<?
/*
|-------------------------------------------------------------------------------
| Вывод сегодняшней даты (блок в хедере справа от лого)
|-------------------------------------------------------------------------------
| Получаем сегодняшнюю дату и приводим её к более привлекательному виду.
|-------------------------------------------------------------------------------
*/
function russianDate() {
// Массив для замены
    $translation = array( 
        "Monday"    => "понедельник", 
        "Tuesday"   => "вторник", 
        "Wednesday" => "среда", 
        "Thursday"  => "четверг", 
        "Friday"    => "пятница", 
        "Saturday"  => "суббота", 
        "Sunday"    => "воскресенье", 
        "January"   => "января", 
        "February"  => "февраля", 
        "March"     => "марта", 
        "April"     => "апреля", 
        "May"       => "мая", 
        "June"      => "июня", 
        "July"      => "июля", 
        "August"    => "августа", 
        "September" => "сентября", 
        "October"   => "октября", 
        "November"  => "ноября", 
        "December"  => "декабря", 
        "st"        => "ое", 
        "nd"        => "ое", 
        "rd"        => "е", 
        "th"        => "ое", 
    ); 
// возвращаем измененную дату      
    return strtr(date('j F Y года, l'), $translation);    
}
// вывод
echo russianDate();